zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/hsm.h
/*
 * Component description for HSM
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-11-05T16:47:53Z  */
#ifndef _PIC32CMSG00_HSM_COMPONENT_H_
#define _PIC32CMSG00_HSM_COMPONENT_H_

#include "core_cm23.h"

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR HSM                       */
/* ************************************************************************** */

/* -------- HSM_CTRLA : (HSM Offset: 0x00) (R/W 32) Control Register A -------- */
#define HSM_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (HSM_CTRLA) Control Register A  Reset Value */

#define HSM_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (HSM_CTRLA) Software Reset1 = Reset registers and internal state0 = No effect Position */
#define HSM_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << HSM_CTRLA_SWRST_Pos)               /* (HSM_CTRLA) Software Reset1 = Reset registers and internal state0 = No effect Mask */
#define HSM_CTRLA_SWRST(value)                (HSM_CTRLA_SWRST_Msk & (_UINT32_(value) << HSM_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the HSM_CTRLA register */
#define HSM_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (HSM_CTRLA) Macro/Clock Enable bit Position */
#define HSM_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << HSM_CTRLA_ENABLE_Pos)              /* (HSM_CTRLA) Macro/Clock Enable bit Mask */
#define HSM_CTRLA_ENABLE(value)               (HSM_CTRLA_ENABLE_Msk & (_UINT32_(value) << HSM_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the HSM_CTRLA register */
#define   HSM_CTRLA_ENABLE_0_Val              _UINT32_(0x0)                                        /* (HSM_CTRLA) HSM clock is not requested and macros is disabled.  */
#define   HSM_CTRLA_ENABLE_1_Val              _UINT32_(0x1)                                        /* (HSM_CTRLA) HSM clock is requested and macro is enabled.  */
#define HSM_CTRLA_ENABLE_0                    (HSM_CTRLA_ENABLE_0_Val << HSM_CTRLA_ENABLE_Pos)     /* (HSM_CTRLA) HSM clock is not requested and macros is disabled. Position */
#define HSM_CTRLA_ENABLE_1                    (HSM_CTRLA_ENABLE_1_Val << HSM_CTRLA_ENABLE_Pos)     /* (HSM_CTRLA) HSM clock is requested and macro is enabled. Position */
#define HSM_CTRLA_PRIV_Pos                    _UINT32_(2)                                          /* (HSM_CTRLA) Privileged Access Only - This bit affects all Wrapper and EIP registers. Position */
#define HSM_CTRLA_PRIV_Msk                    (_UINT32_(0x1) << HSM_CTRLA_PRIV_Pos)                /* (HSM_CTRLA) Privileged Access Only - This bit affects all Wrapper and EIP registers. Mask */
#define HSM_CTRLA_PRIV(value)                 (HSM_CTRLA_PRIV_Msk & (_UINT32_(value) << HSM_CTRLA_PRIV_Pos)) /* Assignment of value for PRIV in the HSM_CTRLA register */
#define   HSM_CTRLA_PRIV_0_Val                _UINT32_(0x0)                                        /* (HSM_CTRLA) HSM registers accessible in privileged and unprivileged modes. Master Requests are NOT privileged  */
#define   HSM_CTRLA_PRIV_1_Val                _UINT32_(0x1)                                        /* (HSM_CTRLA) HSM registers only accessible in privileged mode.  Master Requests are also privileged.  */
#define HSM_CTRLA_PRIV_0                      (HSM_CTRLA_PRIV_0_Val << HSM_CTRLA_PRIV_Pos)         /* (HSM_CTRLA) HSM registers accessible in privileged and unprivileged modes. Master Requests are NOT privileged Position */
#define HSM_CTRLA_PRIV_1                      (HSM_CTRLA_PRIV_1_Val << HSM_CTRLA_PRIV_Pos)         /* (HSM_CTRLA) HSM registers only accessible in privileged mode.  Master Requests are also privileged. Position */
#define HSM_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (HSM_CTRLA) Run In Standby bit Position */
#define HSM_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << HSM_CTRLA_RUNSTDBY_Pos)            /* (HSM_CTRLA) Run In Standby bit Mask */
#define HSM_CTRLA_RUNSTDBY(value)             (HSM_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << HSM_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the HSM_CTRLA register */
#define   HSM_CTRLA_RUNSTDBY_0_Val            _UINT32_(0x0)                                        /* (HSM_CTRLA) HSM clock is disabled in Standby Sleep mode, clock requests are de-asserted after any pending bus transactions or requests are completed.  */
#define   HSM_CTRLA_RUNSTDBY_1_Val            _UINT32_(0x1)                                        /* (HSM_CTRLA) If enabled, the HSM clock remains requested in Standby Sleep mode.  */
#define HSM_CTRLA_RUNSTDBY_0                  (HSM_CTRLA_RUNSTDBY_0_Val << HSM_CTRLA_RUNSTDBY_Pos) /* (HSM_CTRLA) HSM clock is disabled in Standby Sleep mode, clock requests are de-asserted after any pending bus transactions or requests are completed. Position */
#define HSM_CTRLA_RUNSTDBY_1                  (HSM_CTRLA_RUNSTDBY_1_Val << HSM_CTRLA_RUNSTDBY_Pos) /* (HSM_CTRLA) If enabled, the HSM clock remains requested in Standby Sleep mode. Position */
#define HSM_CTRLA_Msk                         _UINT32_(0x00000047)                                 /* (HSM_CTRLA) Register Mask  */


