zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/hsm.h
#define HSM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__FETCH_TAG)  Position */
#define HSM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Msk (_UINT32_(0xFFFFFFFF) << HSM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Pos) /* (HSM_CryptoMaster_DMA_Registers__FETCH_TAG)  Mask */
#define HSM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG(value) (HSM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Pos)) /* Assignment of value for FETCH_TAG in the HSM_CryptoMaster_DMA_Registers__FETCH_TAG register */
#define HSM_CryptoMaster_DMA_Registers__FETCH_TAG_Msk _UINT32_(0xFFFFFFFF)                                 /* (HSM_CryptoMaster_DMA_Registers__FETCH_TAG) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB : (HSM Offset: 0x10010) (R/W 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB)  Position */
#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Msk (_UINT32_(0xFFFFFFFF) << HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos) /* (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB)  Mask */
#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB(value) (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos)) /* Assignment of value for PUSH_ADDR_LSB in the HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB register */
#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_Msk _UINT32_(0xFFFFFFFF)                                 /* (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB : (HSM Offset: 0x10014) (R/W 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB)  Position */
#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Msk (_UINT32_(0xFFFFFFFF) << HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos) /* (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB)  Mask */
#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB(value) (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos)) /* Assignment of value for PUSH_ADDR_MSB in the HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB register */
#define HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_Msk _UINT32_(0xFFFFFFFF)                                 /* (HSM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__PUSH_LEN : (HSM Offset: 0x10018) (R/W 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__PUSH_LEN)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__PUSH_LEN)  Position */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Msk (_UINT32_(0xFFFFFFF) << HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Pos) /* (HSM_CryptoMaster_DMA_Registers__PUSH_LEN)  Mask */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN(value) (HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Pos)) /* Assignment of value for PUSH_LEN in the HSM_CryptoMaster_DMA_Registers__PUSH_LEN register */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Pos _UINT32_(28)                                         /* (HSM_CryptoMaster_DMA_Registers__PUSH_LEN)  Position */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Pos) /* (HSM_CryptoMaster_DMA_Registers__PUSH_LEN)  Mask */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR(value) (HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Pos)) /* Assignment of value for PUSH_CSTADDR in the HSM_CryptoMaster_DMA_Registers__PUSH_LEN register */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Pos _UINT32_(29)                                         /* (HSM_CryptoMaster_DMA_Registers__PUSH_LEN)  Position */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Pos) /* (HSM_CryptoMaster_DMA_Registers__PUSH_LEN)  Mask */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN(value) (HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Pos)) /* Assignment of value for PUSH_REALIGN in the HSM_CryptoMaster_DMA_Registers__PUSH_LEN register */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Pos _UINT32_(30)                                         /* (HSM_CryptoMaster_DMA_Registers__PUSH_LEN)  Position */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Pos) /* (HSM_CryptoMaster_DMA_Registers__PUSH_LEN)  Mask */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD(value) (HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Pos)) /* Assignment of value for PUSH_DISCARD in the HSM_CryptoMaster_DMA_Registers__PUSH_LEN register */
#define HSM_CryptoMaster_DMA_Registers__PUSH_LEN_Msk _UINT32_(0x7FFFFFFF)                                 /* (HSM_CryptoMaster_DMA_Registers__PUSH_LEN) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__INT_EN : (HSM Offset: 0x1001C) (R/W 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__INT_EN_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__INT_EN)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__INT_EN)  Position */
#define HSM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Msk (_UINT32_(0x3F) << HSM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Pos) /* (HSM_CryptoMaster_DMA_Registers__INT_EN)  Mask */
#define HSM_CryptoMaster_DMA_Registers__INT_EN_INT_EN(value) (HSM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Pos)) /* Assignment of value for INT_EN in the HSM_CryptoMaster_DMA_Registers__INT_EN register */
#define HSM_CryptoMaster_DMA_Registers__INT_EN_Msk _UINT32_(0x0000003F)                                 /* (HSM_CryptoMaster_DMA_Registers__INT_EN) Register Mask  */


