zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/hsm.h
/* -------- HSM_CryptoMaster_DMA_Registers__INT_ENSET : (HSM Offset: 0x10020) ( /W 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__INT_ENSET_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__INT_ENSET)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__INT_ENSET)  Position */
#define HSM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Msk (_UINT32_(0x3F) << HSM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Pos) /* (HSM_CryptoMaster_DMA_Registers__INT_ENSET)  Mask */
#define HSM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET(value) (HSM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Pos)) /* Assignment of value for INT_ENSET in the HSM_CryptoMaster_DMA_Registers__INT_ENSET register */
#define HSM_CryptoMaster_DMA_Registers__INT_ENSET_Msk _UINT32_(0x0000003F)                                 /* (HSM_CryptoMaster_DMA_Registers__INT_ENSET) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__INT_ENCLR : (HSM Offset: 0x10024) ( /W 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__INT_ENCLR_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__INT_ENCLR)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__INT_ENCLR)  Position */
#define HSM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Msk (_UINT32_(0x3F) << HSM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Pos) /* (HSM_CryptoMaster_DMA_Registers__INT_ENCLR)  Mask */
#define HSM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR(value) (HSM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Pos)) /* Assignment of value for INT_ENCLR in the HSM_CryptoMaster_DMA_Registers__INT_ENCLR register */
#define HSM_CryptoMaster_DMA_Registers__INT_ENCLR_Msk _UINT32_(0x0000003F)                                 /* (HSM_CryptoMaster_DMA_Registers__INT_ENCLR) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__INT_STATRAW : (HSM Offset: 0x10028) ( R/ 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__INT_STATRAW_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__INT_STATRAW)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__INT_STATRAW)  Position */
#define HSM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Msk (_UINT32_(0x3F) << HSM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Pos) /* (HSM_CryptoMaster_DMA_Registers__INT_STATRAW)  Mask */
#define HSM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW(value) (HSM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Pos)) /* Assignment of value for INT_STATRAW in the HSM_CryptoMaster_DMA_Registers__INT_STATRAW register */
#define HSM_CryptoMaster_DMA_Registers__INT_STATRAW_Msk _UINT32_(0x0000003F)                                 /* (HSM_CryptoMaster_DMA_Registers__INT_STATRAW) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__INT_STAT : (HSM Offset: 0x1002C) ( R/ 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__INT_STAT_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__INT_STAT)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__INT_STAT)  Position */
#define HSM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Msk (_UINT32_(0x3F) << HSM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Pos) /* (HSM_CryptoMaster_DMA_Registers__INT_STAT)  Mask */
#define HSM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT(value) (HSM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Pos)) /* Assignment of value for INT_STAT in the HSM_CryptoMaster_DMA_Registers__INT_STAT register */
#define HSM_CryptoMaster_DMA_Registers__INT_STAT_Msk _UINT32_(0x0000003F)                                 /* (HSM_CryptoMaster_DMA_Registers__INT_STAT) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__INT_STATCLR : (HSM Offset: 0x10030) ( /W 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__INT_STATCLR_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__INT_STATCLR)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__INT_STATCLR)  Position */
#define HSM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Msk (_UINT32_(0x3F) << HSM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Pos) /* (HSM_CryptoMaster_DMA_Registers__INT_STATCLR)  Mask */
#define HSM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR(value) (HSM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Pos)) /* Assignment of value for INT_STATCLR in the HSM_CryptoMaster_DMA_Registers__INT_STATCLR register */
#define HSM_CryptoMaster_DMA_Registers__INT_STATCLR_Msk _UINT32_(0x0000003F)                                 /* (HSM_CryptoMaster_DMA_Registers__INT_STATCLR) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__CONFIG : (HSM Offset: 0x10034) (R/W 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__CONFIG)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Pos) /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT(value) (HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Pos)) /* Assignment of value for FETCH_CTRL_INDIRECT in the HSM_CryptoMaster_DMA_Registers__CONFIG register */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Pos _UINT32_(1)                                          /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Pos) /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT(value) (HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Pos)) /* Assignment of value for PUSH_CTRL_INDIRECT in the HSM_CryptoMaster_DMA_Registers__CONFIG register */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Pos _UINT32_(2)                                          /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Pos) /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP(value) (HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Pos)) /* Assignment of value for FETCH_STOP in the HSM_CryptoMaster_DMA_Registers__CONFIG register */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Pos _UINT32_(3)                                          /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Pos) /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP(value) (HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Pos)) /* Assignment of value for PUSH_STOP in the HSM_CryptoMaster_DMA_Registers__CONFIG register */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Pos _UINT32_(4)                                          /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Pos) /* (HSM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST(value) (HSM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Pos)) /* Assignment of value for SOFT_RST in the HSM_CryptoMaster_DMA_Registers__CONFIG register */
#define HSM_CryptoMaster_DMA_Registers__CONFIG_Msk _UINT32_(0x0000001F)                                 /* (HSM_CryptoMaster_DMA_Registers__CONFIG) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__START : (HSM Offset: 0x10038) ( /W 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__START_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__START)   Reset Value */

#define HSM_CryptoMaster_DMA_Registers__START_START_FETCH_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__START)  Position */
#define HSM_CryptoMaster_DMA_Registers__START_START_FETCH_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__START_START_FETCH_Pos) /* (HSM_CryptoMaster_DMA_Registers__START)  Mask */
#define HSM_CryptoMaster_DMA_Registers__START_START_FETCH(value) (HSM_CryptoMaster_DMA_Registers__START_START_FETCH_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__START_START_FETCH_Pos)) /* Assignment of value for START_FETCH in the HSM_CryptoMaster_DMA_Registers__START register */
#define HSM_CryptoMaster_DMA_Registers__START_START_PUSH_Pos _UINT32_(1)                                          /* (HSM_CryptoMaster_DMA_Registers__START)  Position */
#define HSM_CryptoMaster_DMA_Registers__START_START_PUSH_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__START_START_PUSH_Pos) /* (HSM_CryptoMaster_DMA_Registers__START)  Mask */
#define HSM_CryptoMaster_DMA_Registers__START_START_PUSH(value) (HSM_CryptoMaster_DMA_Registers__START_START_PUSH_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__START_START_PUSH_Pos)) /* Assignment of value for START_PUSH in the HSM_CryptoMaster_DMA_Registers__START register */
#define HSM_CryptoMaster_DMA_Registers__START_Msk _UINT32_(0x00000003)                                 /* (HSM_CryptoMaster_DMA_Registers__START) Register Mask  */


/* -------- HSM_CryptoMaster_DMA_Registers__STATUS : (HSM Offset: 0x1003C) ( R/ 32)  -------- */
#define HSM_CryptoMaster_DMA_Registers__STATUS_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_CryptoMaster_DMA_Registers__STATUS)   Reset Value */

