zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/hsm.h
#define HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Pos) /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY(value) (HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Pos)) /* Assignment of value for FETCH_BUSY in the HSM_CryptoMaster_DMA_Registers__STATUS register */
#define HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Pos _UINT32_(1)                                          /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Pos) /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY(value) (HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Pos)) /* Assignment of value for PUSH_BUSY in the HSM_CryptoMaster_DMA_Registers__STATUS register */
#define HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Pos _UINT32_(4)                                          /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Pos) /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY(value) (HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Pos)) /* Assignment of value for FETCH_NOT_EMPTY in the HSM_CryptoMaster_DMA_Registers__STATUS register */
#define HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Pos _UINT32_(5)                                          /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Pos) /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO(value) (HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Pos)) /* Assignment of value for PUSH_WAITINGFIFO in the HSM_CryptoMaster_DMA_Registers__STATUS register */
#define HSM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Pos _UINT32_(6)                                          /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define HSM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Msk (_UINT32_(0x1) << HSM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Pos) /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define HSM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY(value) (HSM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Pos)) /* Assignment of value for SOFT_RST_BUSY in the HSM_CryptoMaster_DMA_Registers__STATUS register */
#define HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Pos _UINT32_(16)                                         /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Msk (_UINT32_(0xFFFF) << HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Pos) /* (HSM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA(value) (HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Msk & (_UINT32_(value) << HSM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Pos)) /* Assignment of value for PUSH_NBDATA in the HSM_CryptoMaster_DMA_Registers__STATUS register */
#define HSM_CryptoMaster_DMA_Registers__STATUS_Msk _UINT32_(0xFFFF0073)                                 /* (HSM_CryptoMaster_DMA_Registers__STATUS) Register Mask  */


/* -------- HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG : (HSM Offset: 0x10400) ( R/ 32)  -------- */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_RESETVALUE _UINT32_(0x611)                                      /*  (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG)   Reset Value */

#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAES value. BA411E-AES IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAES value. BA411E-AES IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos)) /* Assignment of value for BA411_AES_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos _UINT32_(1)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos)) /* Assignment of value for BA415_HP_AES_GCM_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos _UINT32_(2)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos)) /* Assignment of value for BA416_HP_AES_XTS_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos _UINT32_(3)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeDES value. BA412-3DES IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeDES value. BA412-3DES IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos)) /* Assignment of value for BA412_DES_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos _UINT32_(4)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeHASH value. BA413-HASH IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeHASH value. BA413-HASH IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos)) /* Assignment of value for BA413_HASH_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos _UINT32_(5)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos)) /* Assignment of value for BA417_CHACHAPOLY_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos _UINT32_(6)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos)) /* Assignment of value for BA418_SHA3_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos _UINT32_(7)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeZUC  value. BA421-ZUC IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeZUC  value. BA421-ZUC IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos)) /* Assignment of value for BA421_ZUC_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos _UINT32_(8)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSM4  value. BA419-SM4 IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSM4  value. BA419-SM4 IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos)) /* Assignment of value for BA419_SM4_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos _UINT32_(9)                                          /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludePKE  value. BA414EP-PKE IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludePKE  value. BA414EP-PKE IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos)) /* Assignment of value for BA414EP_PKE_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos _UINT32_(10)                                         /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos)) /* Assignment of value for BA431_NDRNG_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos _UINT32_(11)                                         /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos)) /* Assignment of value for BA420_HP_CHACHAPOLY_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos _UINT32_(12)                                         /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos)) /* Assignment of value for BA423_SNOW3G_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos _UINT32_(13)                                         /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set Position */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos) /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set Mask */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED(value) (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos)) /* Assignment of value for BA422_KASUMI_INCLUDED in the HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_Msk _UINT32_(0x00003FFF)                                 /* (HSM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Register Mask  */


/* -------- HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 : (HSM Offset: 0x10404) ( R/ 32)  -------- */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_RESETVALUE _UINT32_(0x1F0301FF)                                 /*  (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1)   Reset Value */

