zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/hsm.h
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_AesModesPoss value. BA411E-AES engine configuration. Position */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Msk (_UINT32_(0x1FF) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos) /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_AesModesPoss value. BA411E-AES engine configuration. Mask */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE(value) (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_MODE in the HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos _UINT32_(16)                                         /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_CS value. BA411E-AES engine configuration. Position */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos) /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_CS value. BA411E-AES engine configuration. Mask */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS(value) (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_CS in the HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos _UINT32_(17)                                         /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_UseMasking value. BA411E-AES engine configuration. Position */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos) /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_UseMasking value. BA411E-AES engine configuration. Mask */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING(value) (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_MASKING in the HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos _UINT32_(24)                                         /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_Keysize value. BA411E-AES engine configuration. Position */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Msk (_UINT32_(0x7) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos) /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_Keysize value. BA411E-AES engine configuration. Mask */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE(value) (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_KEYSIZE in the HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Pos _UINT32_(27)                                         /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_CxSwitch value. BA411E-AES engine configuration. Position */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Pos) /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_CxSwitch value. BA411E-AES engine configuration. Mask */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH(value) (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_CXSWITCH in the HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Pos _UINT32_(28)                                         /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_GlitchProtection value. BA411E-AES engine configuration. Position */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Msk (_UINT32_(0x1) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Pos) /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_GlitchProtection value. BA411E-AES engine configuration. Mask */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION(value) (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_GLITCHPROTECTION in the HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_Msk _UINT32_(0x1F0301FF)                                 /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Register Mask  */


/* -------- HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2 : (HSM Offset: 0x10408) ( R/ 32) Generic g_CtrSize value. BA411E-AES engine configuration. -------- */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_RESETVALUE _UINT32_(0x200080)                                   /*  (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration.  Reset Value */

#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Pos _UINT32_(0)                                          /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Position */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Msk (_UINT32_(0xFFFF) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Pos) /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Mask */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE(value) (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_2_CTRSIZE in the HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2 register */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Pos _UINT32_(20)                                         /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_Ext_nb_AES_keys value. BA411E-AES engine configuration. Position */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Msk (_UINT32_(0xF) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Pos) /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_Ext_nb_AES_keys value. BA411E-AES engine configuration. Mask */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS(value) (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_2_EXTKEYS in the HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2 register */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Pos _UINT32_(24)                                         /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic  g_IKG_nb_AES_keys value. BA411E-AES engine configuration. Position */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Msk (_UINT32_(0xF) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Pos) /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic  g_IKG_nb_AES_keys value. BA411E-AES engine configuration. Mask */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS(value) (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Msk & (_UINT32_(value) << HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_2_IKGKEYS in the HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2 register */
#define HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_Msk _UINT32_(0x0FF0FFFF)                                 /* (HSM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Register Mask  */


/* -------- HSM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG : (HSM Offset: 0x1040C) ( R/ 32)  -------- */
#define HSM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_RESETVALUE _UINT32_(0x13003E)                                   /*  (HSM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG)   Reset Value */

