zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/hsm.h
/* -------- HSM_RNG_Control_Registers__DisableOsc0 : (HSM Offset: 0x11038) (R/W 32) Disable oscillator rings #0 to #31. -------- */
#define HSM_RNG_Control_Registers__DisableOsc0_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_RNG_Control_Registers__DisableOsc0) Disable oscillator rings #0 to #31.  Reset Value */

#define HSM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Pos _UINT32_(0)                                          /* (HSM_RNG_Control_Registers__DisableOsc0) Disable oscillator rings #0 to #31. Position */
#define HSM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Msk (_UINT32_(0xFFFFFFFF) << HSM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Pos) /* (HSM_RNG_Control_Registers__DisableOsc0) Disable oscillator rings #0 to #31. Mask */
#define HSM_RNG_Control_Registers__DisableOsc0_DisableOsc0(value) (HSM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Pos)) /* Assignment of value for DisableOsc0 in the HSM_RNG_Control_Registers__DisableOsc0 register */
#define HSM_RNG_Control_Registers__DisableOsc0_Msk _UINT32_(0xFFFFFFFF)                                 /* (HSM_RNG_Control_Registers__DisableOsc0) Register Mask  */


/* -------- HSM_RNG_Control_Registers__DisableOsc1 : (HSM Offset: 0x1103C) (R/W 32) Disable oscillator rings #32 to #63. -------- */
#define HSM_RNG_Control_Registers__DisableOsc1_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_RNG_Control_Registers__DisableOsc1) Disable oscillator rings #32 to #63.  Reset Value */

#define HSM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Pos _UINT32_(0)                                          /* (HSM_RNG_Control_Registers__DisableOsc1) Disable oscillator rings #32 to #63. Position */
#define HSM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Msk (_UINT32_(0xFFFFFFFF) << HSM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Pos) /* (HSM_RNG_Control_Registers__DisableOsc1) Disable oscillator rings #32 to #63. Mask */
#define HSM_RNG_Control_Registers__DisableOsc1_DisableOsc1(value) (HSM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Pos)) /* Assignment of value for DisableOsc1 in the HSM_RNG_Control_Registers__DisableOsc1 register */
#define HSM_RNG_Control_Registers__DisableOsc1_Msk _UINT32_(0xFFFFFFFF)                                 /* (HSM_RNG_Control_Registers__DisableOsc1) Register Mask  */


/* -------- HSM_RNG_Control_Registers__SwOffTmrVal : (HSM Offset: 0x11040) (R/W 32) Switch off timer value. -------- */
#define HSM_RNG_Control_Registers__SwOffTmrVal_RESETVALUE _UINT32_(0xFFFF)                                     /*  (HSM_RNG_Control_Registers__SwOffTmrVal) Switch off timer value.  Reset Value */

#define HSM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Pos _UINT32_(0)                                          /* (HSM_RNG_Control_Registers__SwOffTmrVal) Number of clk cycles to wait before stopping the rings after the FIFO is full. Position */
#define HSM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Msk (_UINT32_(0xFFFF) << HSM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Pos) /* (HSM_RNG_Control_Registers__SwOffTmrVal) Number of clk cycles to wait before stopping the rings after the FIFO is full. Mask */
#define HSM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal(value) (HSM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Pos)) /* Assignment of value for SwOffTmrVal in the HSM_RNG_Control_Registers__SwOffTmrVal register */
#define HSM_RNG_Control_Registers__SwOffTmrVal_Msk _UINT32_(0x0000FFFF)                                 /* (HSM_RNG_Control_Registers__SwOffTmrVal) Register Mask  */


/* -------- HSM_RNG_Control_Registers__ClkDiv : (HSM Offset: 0x11044) (R/W 32) Sample clock divider. -------- */
#define HSM_RNG_Control_Registers__ClkDiv_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_RNG_Control_Registers__ClkDiv) Sample clock divider.  Reset Value */

#define HSM_RNG_Control_Registers__ClkDiv_ClkDiv_Pos _UINT32_(0)                                          /* (HSM_RNG_Control_Registers__ClkDiv) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Position */
#define HSM_RNG_Control_Registers__ClkDiv_ClkDiv_Msk (_UINT32_(0xFF) << HSM_RNG_Control_Registers__ClkDiv_ClkDiv_Pos) /* (HSM_RNG_Control_Registers__ClkDiv) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Mask */
#define HSM_RNG_Control_Registers__ClkDiv_ClkDiv(value) (HSM_RNG_Control_Registers__ClkDiv_ClkDiv_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__ClkDiv_ClkDiv_Pos)) /* Assignment of value for ClkDiv in the HSM_RNG_Control_Registers__ClkDiv register */
#define HSM_RNG_Control_Registers__ClkDiv_Msk _UINT32_(0x000000FF)                                 /* (HSM_RNG_Control_Registers__ClkDiv) Register Mask  */


/* -------- HSM_RNG_Control_Registers__AIS31Conf0 : (HSM Offset: 0x11048) (R/W 32) AIS31 configuration register 0. -------- */
#define HSM_RNG_Control_Registers__AIS31Conf0_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_RNG_Control_Registers__AIS31Conf0) AIS31 configuration register 0.  Reset Value */

#define HSM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Pos _UINT32_(0)                                          /* (HSM_RNG_Control_Registers__AIS31Conf0) Start-up test threshold. Position */
#define HSM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Msk (_UINT32_(0xFFFF) << HSM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Pos) /* (HSM_RNG_Control_Registers__AIS31Conf0) Start-up test threshold. Mask */
#define HSM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold(value) (HSM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Pos)) /* Assignment of value for StartUpThreshold in the HSM_RNG_Control_Registers__AIS31Conf0 register */
#define HSM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Pos _UINT32_(16)                                         /* (HSM_RNG_Control_Registers__AIS31Conf0) Online threshold. Position */
#define HSM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Msk (_UINT32_(0xFFFF) << HSM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Pos) /* (HSM_RNG_Control_Registers__AIS31Conf0) Online threshold. Mask */
#define HSM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold(value) (HSM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Pos)) /* Assignment of value for OnlineThreshold in the HSM_RNG_Control_Registers__AIS31Conf0 register */
#define HSM_RNG_Control_Registers__AIS31Conf0_Msk _UINT32_(0xFFFFFFFF)                                 /* (HSM_RNG_Control_Registers__AIS31Conf0) Register Mask  */


/* -------- HSM_RNG_Control_Registers__AIS31Conf1 : (HSM Offset: 0x1104C) (R/W 32) AIS31 configuration register 1. -------- */
#define HSM_RNG_Control_Registers__AIS31Conf1_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_RNG_Control_Registers__AIS31Conf1) AIS31 configuration register 1.  Reset Value */

#define HSM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Pos _UINT32_(0)                                          /* (HSM_RNG_Control_Registers__AIS31Conf1) Online repeat threshold. Position */
#define HSM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Msk (_UINT32_(0xFFFF) << HSM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Pos) /* (HSM_RNG_Control_Registers__AIS31Conf1) Online repeat threshold. Mask */
#define HSM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold(value) (HSM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Pos)) /* Assignment of value for OnlineRepThreshold in the HSM_RNG_Control_Registers__AIS31Conf1 register */
#define HSM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Pos _UINT32_(16)                                         /* (HSM_RNG_Control_Registers__AIS31Conf1) Expected history value. Position */
#define HSM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Msk (_UINT32_(0xFFFF) << HSM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Pos) /* (HSM_RNG_Control_Registers__AIS31Conf1) Expected history value. Mask */
#define HSM_RNG_Control_Registers__AIS31Conf1_HExpectedValue(value) (HSM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Pos)) /* Assignment of value for HExpectedValue in the HSM_RNG_Control_Registers__AIS31Conf1 register */
#define HSM_RNG_Control_Registers__AIS31Conf1_Msk _UINT32_(0xFFFFFFFF)                                 /* (HSM_RNG_Control_Registers__AIS31Conf1) Register Mask  */


/* -------- HSM_RNG_Control_Registers__AIS31Conf2 : (HSM Offset: 0x11050) (R/W 32) AIS31 configuration register 2. -------- */
#define HSM_RNG_Control_Registers__AIS31Conf2_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_RNG_Control_Registers__AIS31Conf2) AIS31 configuration register 2.  Reset Value */

#define HSM_RNG_Control_Registers__AIS31Conf2_HMin_Pos _UINT32_(0)                                          /* (HSM_RNG_Control_Registers__AIS31Conf2) Minimum allowed history value. Position */
#define HSM_RNG_Control_Registers__AIS31Conf2_HMin_Msk (_UINT32_(0xFFFF) << HSM_RNG_Control_Registers__AIS31Conf2_HMin_Pos) /* (HSM_RNG_Control_Registers__AIS31Conf2) Minimum allowed history value. Mask */
#define HSM_RNG_Control_Registers__AIS31Conf2_HMin(value) (HSM_RNG_Control_Registers__AIS31Conf2_HMin_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__AIS31Conf2_HMin_Pos)) /* Assignment of value for HMin in the HSM_RNG_Control_Registers__AIS31Conf2 register */
#define HSM_RNG_Control_Registers__AIS31Conf2_HMa_Pos _UINT32_(16)                                         /* (HSM_RNG_Control_Registers__AIS31Conf2) Maximum allowed history value. Position */
#define HSM_RNG_Control_Registers__AIS31Conf2_HMa_Msk (_UINT32_(0xFFFF) << HSM_RNG_Control_Registers__AIS31Conf2_HMa_Pos) /* (HSM_RNG_Control_Registers__AIS31Conf2) Maximum allowed history value. Mask */
#define HSM_RNG_Control_Registers__AIS31Conf2_HMa(value) (HSM_RNG_Control_Registers__AIS31Conf2_HMa_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__AIS31Conf2_HMa_Pos)) /* Assignment of value for HMa in the HSM_RNG_Control_Registers__AIS31Conf2 register */
#define HSM_RNG_Control_Registers__AIS31Conf2_Msk _UINT32_(0xFFFFFFFF)                                 /* (HSM_RNG_Control_Registers__AIS31Conf2) Register Mask  */


/* -------- HSM_RNG_Control_Registers__AIS31Status : (HSM Offset: 0x11054) (R/W 32) AIS31 status register. -------- */
#define HSM_RNG_Control_Registers__AIS31Status_RESETVALUE _UINT32_(0x00)                                       /*  (HSM_RNG_Control_Registers__AIS31Status) AIS31 status register.  Reset Value */

#define HSM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Pos _UINT32_(0)                                          /* (HSM_RNG_Control_Registers__AIS31Status) Number of preliminary noise alarms since counter was last cleared. Position */
#define HSM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Msk (_UINT32_(0xFFFF) << HSM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Pos) /* (HSM_RNG_Control_Registers__AIS31Status) Number of preliminary noise alarms since counter was last cleared. Mask */
#define HSM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms(value) (HSM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Pos)) /* Assignment of value for NumPrelimAlarms in the HSM_RNG_Control_Registers__AIS31Status register */
#define HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Pos _UINT32_(16)                                         /* (HSM_RNG_Control_Registers__AIS31Status) Last preliminary noise alarm occurred due to history value out of range. Position */
#define HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Msk (_UINT32_(0x1) << HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Pos) /* (HSM_RNG_Control_Registers__AIS31Status) Last preliminary noise alarm occurred due to history value out of range. Mask */
#define HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng(value) (HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Pos)) /* Assignment of value for PrelimNoiseAlarmRng in the HSM_RNG_Control_Registers__AIS31Status register */
#define HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Pos _UINT32_(17)                                         /* (HSM_RNG_Control_Registers__AIS31Status) Last preliminary noise alarm occurred due to consecutive high X**2. Position */
#define HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Msk (_UINT32_(0x1) << HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Pos) /* (HSM_RNG_Control_Registers__AIS31Status) Last preliminary noise alarm occurred due to consecutive high X**2. Mask */
#define HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep(value) (HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Msk & (_UINT32_(value) << HSM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Pos)) /* Assignment of value for PrelimNoiseAlarmRep in the HSM_RNG_Control_Registers__AIS31Status register */
#define HSM_RNG_Control_Registers__AIS31Status_Msk _UINT32_(0x0003FFFF)                                 /* (HSM_RNG_Control_Registers__AIS31Status) Register Mask  */


